sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_gatt_aci.h
 * @brief Starts the procedure to discover all characteristic descriptors on the
 *        server. When the procedure is completed, a @ref
 *        aci_gatt_clt_proc_complete_event event is generated. Before procedure
 *        completion the response packets are given through @ref
 *        aci_att_clt_find_info_resp_event event.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param CID Channel Identifier of the ATT bearer. It must be set to 0x0004 for
 *        unenhanced ATT bearer.
 * @param Char_Handle Handle of the characteristic value
 *        Values:
 *        - 0x0001 ... 0xFFFF
 * @param End_Handle End handle of the characteristic
 *        Values:
 *        - 0x0001 ... 0xFFFF
 * @retval Value indicating success or error code.
 */
tBleStatus aci_gatt_clt_disc_all_char_desc(uint16_t Connection_Handle,
                                           uint16_t CID,
                                           uint16_t Char_Handle,
                                           uint16_t End_Handle);
/**
 * @brief Starts the procedure to read an attribute value. When the procedure is
 *        completed, a @ref aci_gatt_clt_proc_complete_event event is generated.
 *        Before procedure completion the response packet is given through @ref
 *        aci_att_clt_read_resp_event event.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param CID Channel Identifier of the ATT bearer. It must be set to 0x0004 for
 *        unenhanced ATT bearer.
 * @param Attr_Handle Handle of the attribute to be read
 *        Values:
 *        - 0x0001 ... 0xFFFF
 * @retval Value indicating success or error code.
 */
tBleStatus aci_gatt_clt_read(uint16_t Connection_Handle,
                             uint16_t CID,
                             uint16_t Attr_Handle);
/**
 * @brief Starts the procedure to read all the characteristics specified by the
 *        UUID. When the procedure is completed, a @ref
 *        aci_gatt_clt_proc_complete_event event is generated. Before procedure
 *        completion the response packets are given through @ref
 *        aci_gatt_clt_disc_read_char_by_uuid_resp_event event.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param CID Channel Identifier of the ATT bearer. It must be set to 0x0004 for
 *        unenhanced ATT bearer.
 * @param Start_Handle Starting handle of the range to be searched
 *        Values:
 *        - 0x0001 ... 0xFFFF
 * @param End_Handle End handle of the range to be searched
 *        Values:
 *        - 0x0001 ... 0xFFFF
 * @param UUID_Type UUID type.
 *        Values:
 *        - 0x01: 16-bit UUID
 *        - 0x02: 128-bit UUID
 * @param UUID See @ref UUID_t
 * @retval Value indicating success or error code.
 */
tBleStatus aci_gatt_clt_read_using_char_uuid(uint16_t Connection_Handle,
                                             uint16_t CID,
                                             uint16_t Start_Handle,
                                             uint16_t End_Handle,
                                             uint8_t UUID_Type,
                                             UUID_t *UUID);
/**
 * @brief Starts the procedure to read a long attribute value. the procedure is
 *        completed, a @ref aci_gatt_clt_proc_complete_event event is generated.
 *        Before procedure completion the response packets are given through
 *        @ref aci_att_clt_read_blob_resp_event event.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param CID Channel Identifier of the ATT bearer. It must be set to 0x0004 for
 *        unenhanced ATT bearer.
 * @param Attr_Handle Handle of the attribute to be read
 *        Values:
 *        - 0x0001 ... 0xFFFF
 * @param Val_Offset Offset from which the value needs to be read
 *        Values:
 *        - 0 ... 511
 * @retval Value indicating success or error code.
 */
tBleStatus aci_gatt_clt_read_long(uint16_t Connection_Handle,
                                  uint16_t CID,
                                  uint16_t Attr_Handle,
                                  uint16_t Val_Offset);
/**
 * @brief Starts a procedure to read multiple characteristic values from a
 *        server. This sub-procedure is used to read multiple Characteristic
 *        Values from a server when the client knows the Characteristic Value
 *        Handles. Only values that have a known fixed size can be read, with
 *        the exception of the last value that can have a variable length. When
 *        the procedure is completed, a @ref aci_gatt_clt_proc_complete_event
 *        event is generated. Before procedure completion the response packets
 *        are given through @ref aci_att_clt_read_multiple_resp_event event. The
 *        response only contains a set of Characteristic Values that is less
 *        than or equal to (ATT_MTU - 1) octets in length. If the Set Of Values
 *        is greater than (ATT_MTU - 1) octets in length, only the first
 *        (ATT_MTU - 1) octets are included in the response.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param CID Channel Identifier of the ATT bearer. It must be set to 0x0004 for
 *        unenhanced ATT bearer.
 * @param Number_of_Handles The number of handles for which the value has to be
 *        read. From 2 to (ATT_MTU-1)/2
 *        Values:
 *        - 0x02 ... 0xFF
 * @param Handle The handles for which the attribute value has to be read
 * @retval Value indicating success or error code.
 */
tBleStatus aci_gatt_clt_read_multiple_char_value(uint16_t Connection_Handle,
                                                 uint16_t CID,
                                                 uint8_t Number_of_Handles,
                                                 uint16_t Handle[]);
/**
 * @brief Starts the procedure to write an attribute (characteristic value or
 *        descriptor). When the procedure is completed, a @ref
 *        aci_gatt_clt_proc_complete_event event is generated.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param CID Channel Identifier of the ATT bearer. It must be set to 0x0004 for
 *        unenhanced ATT bearer.
 * @param Attr_Handle Handle of the attribute to be written
 *        Values:
 *        - 0x0001 ... 0xFFFF
 * @param Attribute_Val_Length Length of the value to be written
 * @param Attribute_Val Value to be written
 * @retval Value indicating success or error code.
 */
tBleStatus aci_gatt_clt_write_nwk(uint16_t Connection_Handle,
                                  uint16_t CID,
                                  uint16_t Attr_Handle,
                                  uint16_t Attribute_Val_Length,
                                  uint8_t Attribute_Val[]);
/**
 * @brief Starts the procedure to write a long attribute value (i.e. an
 *        attribute with a length greater than the current ATT MTU). When the
 *        procedure is completed, a @ref aci_gatt_clt_proc_complete_event event
 *        is generated. During the procedure, @ref
 *        aci_att_clt_prepare_write_resp_event and @ref
 *        aci_att_clt_exec_write_resp_event events are raised.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param CID Channel Identifier of the ATT bearer. It must be set to 0x0004 for
 *        unenhanced ATT bearer.
 * @param Attr_Handle Handle of the attribute to be written
 *        Values:
 *        - 0x0001 ... 0xFFFF
 * @param Val_Offset Offset at which the attribute has to be written
 *        Values:
 *        - 0 ... 511
 * @param Attribute_Val_Length Length of the value to be written
 * @param Attribute_Val Value to be written
 * @retval Value indicating success or error code.
 */
tBleStatus aci_gatt_clt_write_long_nwk(uint16_t Connection_Handle,
                                       uint16_t CID,
                                       uint16_t Attr_Handle,
                                       uint16_t Val_Offset,
                                       uint16_t Attribute_Val_Length,
                                       uint8_t Attribute_Val[]);
/**
 * @brief Starts the procedure to write a characteristic reliably (a check is
 *        made on the written values). When the procedure is completed, a  @ref
 *        aci_gatt_clt_proc_complete_event event is generated. During the
 *        procedure, @ref aci_att_clt_prepare_write_resp_event and @ref
 *        aci_att_clt_exec_write_resp_event events are raised.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param CID Channel Identifier of the ATT bearer. It must be set to 0x0004 for
 *        unenhanced ATT bearer.
 * @param Attr_Handle Handle of the attribute to be written
 *        Values:
 *        - 0x0001 ... 0xFFFF
 * @param Val_Offset Offset at which the attribute has to be written
 *        Values:
 *        - 0 ... 511
 * @param Attribute_Val_Length Length of the value to be written
 * @param Attribute_Val Value to be written
 * @retval Value indicating success or error code.
 */
tBleStatus aci_gatt_clt_write_char_reliable_nwk(uint16_t Connection_Handle,
                                                uint16_t CID,
                                                uint16_t Attr_Handle,
                                                uint16_t Val_Offset,
                                                uint16_t Attribute_Val_Length,
                                                uint8_t Attribute_Val[]);
/**
 * @brief Starts the procedure to write a characteristic value without waiting
 *        for any response from the server. No events are generated after this
 *        command is executed. Writing attributes using this function is not
 *        considered reliable by the standard: packets may be discarded by the
 *        peer if too many write commands are received.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param CID Channel Identifier of the ATT bearer. It must be set to 0x0004 for
 *        unenhanced ATT bearer.
 * @param Attr_Handle Handle of the attribute to be written
 *        Values:
 *        - 0x0001 ... 0xFFFF
 * @param Attribute_Val_Length Length of the value to be written (maximum value
 *        is ATT_MTU - 3)
 * @param Attribute_Val Value to be written
 * @retval Value indicating success or error code.
 */
tBleStatus aci_gatt_clt_write_without_resp(uint16_t Connection_Handle,
                                           uint16_t CID,
                                           uint16_t Attr_Handle,
                                           uint16_t Attribute_Val_Length,
                                           uint8_t Attribute_Val[]);
/**
 * @brief Starts a signed write without response from the server. The procedure
 *        is used to write a characteristic value with an authentication
 *        signature without waiting for any response from the server. It cannot
 *        be used when the link is encrypted, and therefore it cannot be used on
 *        enhanced ATT bearers.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Attr_Handle Handle of the attribute to be written
 *        Values:
 *        - 0x0001 ... 0xFFFF
 * @param Attribute_Val_Length Length of the value to be written (up to ATT_MTU
 *        - 13)
 * @param Attribute_Val Value to be written
 * @retval Value indicating success or error code.
 */
tBleStatus aci_gatt_clt_signed_write_without_resp(uint16_t Connection_Handle,
                                                  uint16_t Attr_Handle,
                                                  uint16_t Attribute_Val_Length,
                                                  uint8_t Attribute_Val[]);
/**
 * @brief Allow application to confirm indication. This command has to be sent
 *        when the application receives the event @ref
 *        aci_gatt_clt_indication_event.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param CID Channel Identifier of the ATT bearer. It must be set to 0x0004 for
 *        unenhanced ATT bearer.
 * @retval Value indicating success or error code.
 */
tBleStatus aci_gatt_clt_confirm_indication(uint16_t Connection_Handle,
                                           uint16_t CID);
/**
 * @brief This command sets the security permission for the attribute handle
 *        specified. Currently the setting of security permission is allowed
 *        only for client characteristic configuration descriptor.
 * @param Attr_Handle Handle of the attribute whose security permission has to
 *        be modified
 *        Values:
 *        - 0x0001 ... 0xFFFF
 * @param Security_Permissions Security permission flags.
 *        Flags:
 *        - 0x00
 *        - 0x01: AUTHEN_READ (Need authentication to read)
 *        - 0x04: ENCRY_READ (Need encryption to read)
 *        - 0x08: AUTHEN_WRITE (need authentication to write)
 *        - 0x20: ENCRY_WRITE (need encryption to write)
 * @retval Value indicating success or error code.
 */
tBleStatus aci_gatt_srv_set_security_permission_nwk(uint16_t Attr_Handle,
                                                    uint8_t Security_Permissions);
/**
 * @brief Reads the value of the attribute handle specified from the local GATT
 *        database. This command cannot be used to read attributes that have
 *        different values for each connection, e.g. the Client Characteristic
 *        Configuration Descriptors or Client Supported Features Characteristic
 *        (in this case, aci_gatt_srv_read_multiple_instance_handle_value needs
 *        to be used).
 * @param Attr_Handle Handle of the attribute to read
 *        Values:
 *        - 0x0001 ... 0xFFFF
 * @param Offset Offset from which the value needs to be read
 *        Values:
 *        - 0 ... 511
 * @param Value_Length_Requested Maximum number of octets to be returned as
 *        attribute value
 *        Values:
 *        - 0 ... 512
 * @param[out] Length Length of the attribute value
 * @param[out] Value_Length Length in octets of the Value parameter
 * @param[out] Value Attribute value
 * @retval Value indicating success or error code.
 */
tBleStatus aci_gatt_srv_read_handle_value_nwk(uint16_t Attr_Handle,
                                              uint16_t Offset,
                                              uint16_t Value_Length_Requested,
                                              uint16_t *Length,
                                              uint16_t *Value_Length,
                                              uint8_t Value[]);
/**
 * @brief This command sets the access permission for the attribute handle
 *        specified.
 * @param Attr_Handle Handle of the attribute whose security permission has to
 *        be modified
 *        Values:
 *        - 0x0001 ... 0xFFFF
 * @param Access_Permissions Access permission
 *        Flags:
 *        - 0x00
 *        - 0x01: READ
 *        - 0x02: WRITE
 *        - 0x04: WRITE_NO_RESP
 *        - 0x08: SIGNED_WRITE
 * @retval Value indicating success or error code.
 */
tBleStatus aci_gatt_srv_set_access_permission_nwk(uint16_t Attr_Handle,
                                                  uint8_t Access_Permissions);
/**
 * @brief Send an indication or notification for the provided attribute handle.
 *        The Flags parameter indicates what kind of message will be sent: -)
 *        0x00 Send a notification -) 0x02 Send an indication
 * @param Connection_Handle Connection handle to be used to identify the
 *        connection with the peer device.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param CID Channel Identifier of the ATT bearer. It must be set to 0x0004 for
 *        unenhanced ATT bearer.
 * @param Attr_Handle Handle of the attribute to be notified
 *        Values:
 *        - 0x0001 ... 0xFFFF
 * @param Flags Select the notification type.
 *        Values:
 *        - 0x00: GATT_NOTIFICATION
 *        - 0x02: GATT_INDICATION
 * @param Val_Length Length of the Val field.
 * @param Val
 * @retval Value indicating success or error code.
 */
tBleStatus aci_gatt_srv_notify(uint16_t Connection_Handle,
                               uint16_t CID,
                               uint16_t Attr_Handle,
                               uint8_t Flags,
                               uint16_t Val_Length,
                               uint8_t Val[]);
/**
 * @brief Response to an @ref aci_att_srv_exec_write_req_event.
 * @param Conn_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param CID Channel Identifier of the ATT bearer. It must be set to 0x0004 for
 *        unenhanced ATT bearer.
 * @param Exec If 1, allow execution of queued writes. If 0 flush all queued
 *        writes for the given connection handle.
 *        Values:
 *        - 0x00: FLUSH
 *        - 0x01: EXECUTE
 * @retval Value indicating success or error code.
 */
tBleStatus aci_gatt_srv_exec_write_resp_nwk(uint16_t Conn_Handle,
                                            uint16_t CID,
                                            uint8_t Exec);
/**
 * @brief This command should be sent when ACI_GATT_SRV_AUTHORIZE_NWK_EVENT is
 *        received.
 * @param Conn_Handle Connection handle to be used to identify the connection
 *        with the peer device.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param CID Channel Identifier of the ATT bearer. It must be set to 0x0004 for
 *        unenhanced ATT bearer.
 * @param Attr_Handle Offset from which the value needs to be read or write
 *        Values:
 *        - 0 ... 511
 * @param Operation_Type
 *        Values:
 *        - 0x00: Read
 *        - 0x10: Write Request
 *        - 0x11: Write Command or Signed Write Command
 *        - 0x12: Prepare Write Request
 * @param Error_Code Set to 0 if operation is authorized, otherwise Error_Code
 *        is the ATT error code that will be sent to the peer in reaponse to the
 *        request.
 *        Values:
 *        - 0: Authorize
 *        - 0 ... 255
 * @param Attr_Val_Offset Offset from which the attribute needs to be read or
 *        written. For a read operation it is always 0.
 *        Values:
 *        - 0 ... 511
 * @param Data_Length Length of Data field
 * @param Data The data that the client has requested to write.
 * @retval Value indicating success or error code.
 */
tBleStatus aci_gatt_srv_authorize_resp_nwk(uint16_t Conn_Handle,
                                           uint16_t CID,
                                           uint16_t Attr_Handle,
                                           uint8_t Operation_Type,
                                           uint8_t Error_Code,
                                           uint16_t Attr_Val_Offset,
                                           uint16_t Data_Length,
                                           uint8_t Data[]);
/**
 * @brief Reads the content of the prepare write queue. This command should be
 *        used to atomically read all the queued write operations after a
 *        aci_att_srv_exec_write_req_event is received and before sending the
 *        aci_gatt_srv_exec_write_resp.
 * @param Conn_Handle Connection handle to be used to identify the connection
 *        with the peer device.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Item_Index The index of the entry in the queue for the selected
 *        connection handle.
 * @param[out] Attr_Handle The attribute handle of the returned entry.
 * @param[out] Value_Offset The offset from which the peer is requesting to
 *             start writing.
 * @param[out] Value_Length Length in octets of the Value parameter
 * @param[out] Value The value to be written.
 * @retval Value indicating success or error code.
 */
tBleStatus aci_gatt_srv_read_prepare_queue_nwk(uint16_t Conn_Handle,
                                               uint8_t Item_Index,
                                               uint16_t *Attr_Handle,
                                               uint16_t *Value_Offset,
                                               uint16_t *Value_Length,
                                               uint8_t Value[]);
/**
 * @brief Updates an attribute value for that kind of attributes that have
 *        different values for each connection, i.e. the Client Characteristic
 *        Configuration Descriptors. WARNING: use of this function can affect
 *        interoperability. Do not use the function unless you are aware of what
 *        you are doing.
 * @param Connection_Handle Connection handle for which the attribute value will
 *        be written.
 * @param Attr_Handle Handle of the attribute
 *        Values:
 *        - 0x0001 ... 0xFFFF
 * @param Value_Length Length of the attribute value in octets.
 * @param Value Attribute value.
 * @retval Value indicating success or error code.
 */
tBleStatus aci_gatt_srv_write_multiple_instance_handle_value(uint16_t Connection_Handle,
                                                             uint16_t Attr_Handle,
                                                             uint16_t Value_Length,
                                                             uint8_t Value[]);
/**
 * @brief Read the value for that kind of attributes that have different values
 *        for each connection, i.e. Client Characteristic Configuration
 *        Descriptors or Client Supported Features Characteristic.
 * @param Connection_Handle Connection handle for which the attribute value will
 *        be read.
 * @param Attr_Handle Handle of the attribute
 *        Values:
 *        - 0x0001 ... 0xFFFF
 * @param[out] Value_Length Length of the attribute value in octets.
 * @param[out] Value Attribute value.
 * @retval Value indicating success or error code.
 */
tBleStatus aci_gatt_srv_read_multiple_instance_handle_value_nwk(uint16_t Connection_Handle,
                                                                uint16_t Attr_Handle,
                                                                uint16_t *Value_Length,
                                                                uint8_t Value[]);
/**
 * @brief Notify multiple characteristic values to a client.
 * @param Connection_Handle Connection handle for which the attribute value will
 *        be read.
 * @param CID Channel Identifier of the ATT bearer. It must be set to 0x0004 for
 *        unenhanced ATT bearer.
 * @param Flags Reserved for future use. Its value must be set to 0.
 *        Values:
 *        - 0x00
 * @param Num_Of_Attr
 * @param Gatt_Srv_Notify_Attr See @ref Gatt_Srv_Notify_Attr_t
 * @retval Value indicating success or error code.
 */
tBleStatus aci_gatt_srv_multi_notify(uint16_t Connection_Handle,
                                     uint16_t CID,
                                     uint8_t Flags,
                                     uint8_t Num_Of_Attr,
                                     Gatt_Srv_Notify_Attr_t Gatt_Srv_Notify_Attr[]);
/**
 * @brief This sub-procedure is used to read multiple Characteristic Values from
 *        a server when the client knows the Characteristic Value Handles. This
 *        procedure is useful when the attributes to read have a variable or
 *        unknown value length (otherwise aci_gatt_clt_read_multiple_char_value
 *        may be used). When the procedure is completed, a @ref
