sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_gatt_aci.h
 *        aci_gatt_clt_proc_complete_event event is generated. Before procedure
 *        completion the response packets are given through @ref
 *        aci_att_clt_read_multiple_var_len_resp_event event.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param CID Channel Identifier of the ATT bearer. It must be set to 0x0004 for
 *        unenhanced ATT bearer.
 * @param Number_of_Handles The number of handles for which the value has to be
 *        read. From 2 to (ATT_MTU-1)/2
 *        Values:
 *        - 0x02 ... 0xFF
 * @param Handle The handles for which the attribute value has to be read
 * @retval Value indicating success or error code.
 */
tBleStatus aci_gatt_clt_read_multiple_var_len_char_value(uint16_t Connection_Handle,
                                                         uint16_t CID,
                                                         uint8_t Number_of_Handles,
                                                         uint16_t Handle[]);
/**
 * @brief Set minimum security level to accept server-initiated packets
 *        (Notification, Indication, Multiple Notification). A default level can
 *        be specified using 0xFFFF value for both Conn_Handle and
 *        Char_Value_Handle values.  If a Notification is received when the
 *        requested minimum security level is not reached then it will be
 *        discarded.  If a Multiple Notification is received and at least one of
 *        its attributes doesn't reach requested minimum security level then the
 *        Multiple Notification is discarded. If an Indication is received when
 *        the requested minimum security level is not reached then a
 *        Confirmation is sent and the Indication is discarded.
 * @param Conn_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Char_Value_Handle Handle of the characteristic value.
 * @param Sec_Level Minimum allowed security level to receive notifications or
 *        indications on the characteristic value.
 * @retval Value indicating success or error code.
 */
tBleStatus aci_gatt_clt_add_subscription_security_level_nwk(uint16_t Conn_Handle,
                                                            uint16_t Char_Value_Handle,
                                                            uint8_t Sec_Level);
/**
     * @}
     */
    #endif /* _STM32WB05N_GATT_ACI_H_ */
